In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
df = pd.read_csv('Data.csv')

In [3]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [4]:
from sklearn.preprocessing import Imputer, LabelEncoder, OneHotEncoder

In [5]:
impute = Imputer()

In [6]:
le = LabelEncoder()
ohe = OneHotEncoder()

In [7]:
impute.fit(df[['Age', 'Salary']])

Imputer(axis=0, copy=True, missing_values='NaN', strategy='mean', verbose=0)

In [8]:
df[['Age', 'Salary']] = impute.transform(df[['Age', 'Salary']])

In [10]:
df.head()

   Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes

In [15]:
df.isnull().all()

Country      False
Age          False
Salary       False
Purchased    False
dtype: bool

In [17]:
X = le.fit_transform(df['Country'])

In [19]:
ohe.fit(X.reshape(-1, 1))

OneHotEncoder(categorical_features='all', dtype=<class 'numpy.float64'>,
       handle_unknown='error', n_values='auto', sparse=True)

In [20]:
country = ohe.transform(X.reshape(-1, 1))

In [21]:
country = country.toarray()

In [22]:
country

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.]])

In [26]:
ohe.get_params

<bound method BaseEstimator.get_params of OneHotEncoder(categorical_features='all', dtype=<class 'numpy.float64'>,
       handle_unknown='error', n_values='auto', sparse=True)>

In [27]:
le.classes_

array(['France', 'Germany', 'Spain'], dtype=object)

In [32]:
df_country = pd.DataFrame(country, columns=le.classes_, dtype=np.int8)

In [33]:
df_country

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       0        1      0
3       0        0      1
4       0        1      0
5       1        0      0
6       0        0      1
7       1        0      0
8       0        1      0
9       1        0      0

         Age        Salary Purchased
0  44.000000  72000.000000        No
1  27.000000  48000.000000       Yes
2  30.000000  54000.000000        No
3  38.000000  61000.000000        No
4  40.000000  63777.777778       Yes
5  35.000000  58000.000000       Yes
6  38.777778  52000.000000        No
7  48.000000  79000.000000       Yes
8  50.000000  83000.000000        No
9  37.000000  67000.000000       Yes

Country      False
Age          False
Salary       False
Purchased    False
dtype: bool

In [42]:
pd.concat([df_country, df.drop('Country', axis=1)], axis=1)

   France  Germany  Spain        Age        Salary Purchased
0       1        0      0  44.000000  72000.000000        No
1       0        0      1  27.000000  48000.000000       Yes
2       0        1      0  30.000000  54000.000000        No
3       0        0      1  38.000000  61000.000000        No
4       0        1      0  40.000000  63777.777778       Yes
5       1        0      0  35.000000  58000.000000       Yes
6       0        0      1  38.777778  52000.000000        No
7       1        0      0  48.000000  79000.000000       Yes
8       0        1      0  50.000000  83000.000000        No
9       1        0      0  37.000000  67000.000000       Yes

In [43]:
pd.get_dummies(df['Country'])

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       0        1      0
3       0        0      1
4       0        1      0
5       1        0      0
6       0        0      1
7       1        0      0
8       0        1      0
9       1        0      0